       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOCBL.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-DATA-VARS.
           05 WS-VAR1               PIC X(20).

       PROCEDURE DIVISION.
       0000-MAIN.
           PERFORM 1000-INIT-PARA
              THRU 1000-INIT-PARA-EXIT
           PERFORM 2000-DISPLAY-PARA
              THRU 2000-DISPLAY-PARA-EXIT.
           STOP RUN.

       1000-INIT-PARA.
           INITIALIZE WS-VAR1.

       1000-INIT-PARA-EXIT. EXIT.

       2000-DISPLAY-PARA.
           DISPLAY "wELCOME TO DBB COBOL ".

       2000-DISPLAY-PARA-EXIT. EXIT.